Ran Plan for project: `02.2-tiers-ec2` dir: `terraform/scenario/02.2-tiers-ec2` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.network.data.aws_availability_zones.available: Reading...
module.network.module.nat.data.aws_ami.this: Reading...
module.network.data.aws_availability_zones.available: Read complete after 0s [id=ap-northeast-2]
module.network.module.nat.data.aws_ami.this: Read complete after 1s [id=ami-0e4f2a1b8f55a8acd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.network.aws_eip.nat will be created
+ resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       arn                  = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = (known after apply)
+       id                   = (known after apply)
+       instance             = (known after apply)
+       ipam_pool_id         = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       ptr_record           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all             = {
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc                  = (known after apply)
    }

  # module.db.module.sg_rds.aws_security_group.this_name_prefix[0] will be created
+ resource "aws_security_group" "this_name_prefix" {
+       arn                    = (known after apply)
+       description            = "MySQL security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "rds-instance-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"        = "rds-instance"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       tags_all               = {
+           "Name"        = "rds-instance"
+           "Terraform"   = "true"
+           "environment" = "dev"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "10m"
+           delete = "15m"
        }
    }

  # module.db.module.sg_rds.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
+       cidr_blocks              = [
+           "10.0.0.0/16",
        ]
+       description              = "MySQL access from within VPC"
+       from_port                = 3306
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 3306
+       type                     = "ingress"
    }

  # module.network.module.nat.aws_autoscaling_group.this will be created
+ resource "aws_autoscaling_group" "this" {
+       arn                              = (known after apply)
+       availability_zones               = (known after 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.